"""
Аналитический сервис по управлению платными подписками
Функции:
    1. ведение платных подписок чтобы не забыть отписаться
    2. аналитика расходов - подсчитывает сколько потрачено на подписку, сколько будет стоить в год и тд
    3. с помощью AI аналитики сколько потрачено на подписки по категориям
    4. парсинг например Т-Банк чтобы показывать пользователю подписки со скидкой
    5. возможность выделения бюджета на конкретную подписку чтобы получать уведомление о необходимости отменить подписку
    6. уведомление о скором завершении подписки
"""
